# FilteredWorksetCollector Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilteredWorksetCollector Constructor
FilteredWorksetCollector Class See Also
---
Constructs a new FilteredWorksetCollector that will search and filter the set of worksets in a document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public FilteredWorksetCollector(
	Document document
)
```

Visual Basic
---
```text
Public Sub New ( _
	document As Document _
)
```

Visual C++
---
```text
public:
FilteredWorksetCollector(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FilteredWorksetCollector Class
Autodesk.Revit.DB Namespace